-- Name: forfudan_tc_filter.lua
-- 名称: 繁體常用字符過濾腳本
-- Version: 20221220
-- Author: forFudan 朱宇浩 <dr.yuhao.zhu@outlook.com>
-- Github: https://github.com/forFudan/
-- Purpose: 從候選項中過濾出常用繁體字(《古籍印刷通規》字形)
---------------------------------------
--
-- 介紹:
-- 字符過濾 charaset_filter 在鼠鬚管中不再有效,因爲 librime-charcode 被單獨出来作爲插件.
-- 所以我寫了這箇 lua 腳本過濾常用繁體字.
-- 爲了允许標點符号，我把它们加入了字符集中.
-- 用户可以在 str 變量加入自己想包括的字符.
--
-- 功能:
-- (1) forfudan_tc_only: 過濾常用字符,且不顯示其他字符.
-- (2) forfudan_tc_first: 将常用字符前置. 原因:在某些形碼碼表中,全碼單字(生僻)會優先於全碼詞語(常用),開啓後可將全碼詞調整到生僻字前面.
--
-- 性能:
-- 經實測,關閉預測功能後不會影響性能;開啓預測功能後,老機器有可能有延遲.
--
-- Description:
-- The charaset_filter is not enabled in the Squirrel as librime-charcode was exclused as a standalone plug-in.
-- So a lua filter would be helpful to filter the frequently used characters (GB2312 + 常用國字標準字體表 + other characters).
--
-- 使用方法:
-- (1) 需要將此 lua 文件放在 lua 文件夾下
-- (2) 需要在 rime.lua 中添加以下代碼激活本腳本:
-- forfudan_tc_filter = require("forfudan_tc_filter")
-- forfudan_tc_first = forfudan_tc_filter.forfudan_tc_first
-- forfudan_tc_only = forfudan_tc_filter.forfudan_tc_only
-- (3) 需要在 switches 添加狀態:
-- - options: [forfudan_tc_only, forfudan_tc_first, utf8]
-- states: [常用字過濾, 常用字前置, UTF-8]
-- reset: 1
-- (4) 需要在 engine/filters 添加:
-- - lua_filter@forfudan_tc_first
-- - lua_filter@forfudan_tc_only
-- (5) 需要添加以下代碼防止符號不上屏:
-- forfudan_tc_only:
--   tags: [abc]
-- (6) 建議關閉預測以提升性能, CPU 性能強大的朋友可以忽略本條:
-- translator/enable_completion: false
---------------------------

local str =
"〇㞞㨃一丁七万丈三上下不与丐丑专且丕世丘丙业丛东丝丞丢两严並丧个丫中丰串临丸丹为主丽举乃久么义之乌乍乎乏乐乒乓乔乖乘乙乜九乞也习乡书乩买乱乳乾亂了予争事二于亏云互亓五井亘亙亚些亞亟亡亢交亥亦产亨亩享京亭亮亲亳亵人亿什仁仃仄仅仆仇今介仍从仑仓仔仕他仗付仙仝仞仟代令以仨仪们仰仲仵件价任份仿企伉伊伍伎伏伐休众优伙会伛伞伟传伢伤伥伦伧伪伫伯估伴伶伸伺似伽佃但佇佈位低住佐佑体佔何佗佘余佚佛作佝佞佟你佣佤佥佩佬佯佰佳併佶佻佼使侃侄來侈侉例侍侏侑侖侗供依侠侣侥侦侧侨侩侪侬侮侯侵侶侷便俁係促俄俅俊俎俏俐俑俗俘俚保俞俟俠信俣俦俨俩俪俬俭修俯俱俳俸俺俾倀倆倉個倌倍倏們倒倔倘候倚倜借倡倥倦倨倩倪倫倬倭债值倾偃假偈偉偌偎偏偕做停健偬側偵偶偷偺偻偿傀傅傈傍傑傖傘備傢傣傥储傩催傭傯傲傳傴債傷傻傾僂僅僉像僑僕僖僚僞僥僧僭僮僱僵價僻儀儂億儆儈儉儋儒儔儕儘償儡優儲儷儺儻儼儿兀允元兄充兆兇先光克免兑兒兔兕兖兗党兜兢入全兩八公六兮兰共关兴兵其具典兹养兼兽冀冁内冇冈冉册再冒冕冗写军农冠冢冤冥冪冬冯冰冲决况冶冷冻冼冽净凄准凉凋凌凍减凑凛凜凝几凡凤凫凭凯凰凱凳凶凸凹出击凼函凿刀刁刃分切刈刊刍刎刑划列刘则刚创初删判刨利别刮到刴制刷券刹刺刻刽刿剀剁剂剃則削剋剌前剐剑剔剖剛剜剝剥剧剩剪剮副割剴創剷剽剿劃劇劈劉劊劌劍劑力劝办功加务劣动助努劫劭励劲劳劾势勁勃勇勉勋勐勒動勖勗勘務勝勞募勢勤勳勵勸勺勾勿匀包匆匈匍匐匕化北匙匝匠匡匣匪匮匯匱匹区医匾匿區十千卅升午卉半华协卑卒卓協单卖南博卜卞卟占卡卢卤卦卧卫卮卯印危即却卵卷卸卻卽卿厂厄厅历厉压厌厕厘厚厝原厢厥厦厨厩厭厮厲去县叁参參又叉及友双反发叔取受变叙叛叟叠叢口古句另叨叩只叫召叭叮可台叱史右叵叶号司叹叻叼叽吁吃各吆合吉吊吋同名后吏吐向吒吓吕吖吗君吝吞吟吠吡否吧吨吩含听吭吮启吱吳吴吵吸吹吻吼吾呀呂呃呆呈告呎呐呓呔呕呖呗员呛呜呢呤呦周呱呲味呵呶呷呸呻呼命咀咂咄咆咋和咎咏咐咒咔咕咖咙咚咛咝咣咤咦咧咨咩咪咫咬咯咱咳咸咻咽咿哀品哂哄哆哇哈哉响哎哏哐哑哒哓哔哗哙哚哝哞哟員哥哦哧哨哩哪哭哮哲哺哼哽唁唄唆唇唉唏唐唔唠唢唤唧唬售唯唰唱唳唷唸唾唿啁啃啄商啊問啐啓啕啖啜啞啡啤啥啦啧啪啬啭啮啵啷啸啻啼啾喀喁喂喃善喇喈喉喊喋喏喑喔喘喙喚喜喝喟喧喪喫喬單喱喲喳喵喷喻喽嗄嗅嗆嗇嗎嗑嗓嗔嗖嗚嗜嗝嗞嗟嗡嗣嗤嗥嗦嗨嗩嗫嗬嗯嗲嗳嗵嗶嗷嗽嘀嘁嘆嘈嘉嘍嘎嘔嘖嘗嘘嘛嘞嘟嘡嘣嘤嘩嘬嘭嘮嘯嘰嘱嘲嘴嘵嘶嘹嘻嘿噁噌噎噔噗噘噙噜噠噢噤噥器噩噪噫噬噯噱噲噴噶噸噹噻噼嚀嚅嚇嚎嚏嚐嚓嚕嚣嚥嚦嚨嚮嚯嚴嚶嚷嚼囀囁囂囅囈囊囌囑囔囗囚四回因囡团囤囫园困囱围囵囹固国图囿圃圄圆圇圈圉國圍園圓圖團圜土圣在圩圭地圳场圻圾址坂均坊坍坎坏坐坑块坚坛坝坞坟坠坡坤坦坨坪坯坳坷坻垂垃垄垅垆型垒垓垛垜垠垢垣垦垩垫垭垮埂埃埋城埔埙埚域埠埡執培基堀堂堅堆堊堑堕堝堞堡堤堪堯堰報場堵塄塊塋塌塑塔塗塘塚塞塢填塬塵塹塾墀境墅墉墊墒墓墙墜增墟墨墩墮墳墾壁壅壇壎壑壓壕壘壚壞壟壢壤壩士壬壮壯声壳壶壹壺壽处备复夏夔夕外夙多夜够夢夤夥大天太夫夭央夯失头夷夸夹夺夾奁奂奄奇奈奉奋奎奏奐契奔奕奖套奘奚奠奢奥奧奩奪奮女奴奶奸她好妁如妃妄妆妇妈妊妍妒妓妖妗妙妝妞妣妤妥妨妩妪妫妮妯妲妹妻妾姆姊始姐姑姒姓委姗姘姚姜姝姣姤姥姦姨姬姹姻姿威娃娄娅娆娇娈娉娌娑娓娘娛娜娟娠娣娥娩娱娲娴娶娼婀婁婆婉婊婕婚婢婦婧婪婭婴婵婶婷婺婿媒媚媛媧媪媲媳媸媼媽媾嫁嫂嫉嫋嫌嫒嫔嫖嫗嫘嫡嫣嫦嫩嫫嫱嫵嫻嬀嬈嬉嬋嬌嬗嬙嬡嬪嬰嬴嬷嬸孀孃孌子孑孓孔孕字存孙孚孛孜孝孟孢季孤学孩孪孫孬孰孱孳孵學孺孽孿宁它宅宇守安宋完宏宓宕宗官宙定宛宜宝实宠审客宣室宥宦宪宫宮宰害宴宵家宸容宽宾宿寂寄寅密寇富寐寒寓寝寞察寡寢寤寥實寧寨審寫寬寮寰寵寶寸对寺寻导寿封射将將專尉尊尋對導小少尔尕尖尘尚尝尤尧尬就尴尷尸尹尺尻尼尽尾尿局屁层屄居屆屈屉届屋屌屍屎屏屐屑展屙屜属屠屡屢層履屬屯山屹屿岁岂岈岌岐岑岔岖岗岘岙岚岛岡岢岩岫岬岭岱岳岷岸岿峁峄峋峒峙峡峤峥峦峨峪峭峰峴島峻峽崁崂崃崆崇崍崎崑崔崖崗崙崛崢崤崧崩崭崮崴崽嵇嵋嵌嵐嵘嵩嵬嵯嶂嶄嶇嶗嶙嶠嶧嶷嶸嶺嶼嶽巅巋巍巒巔巖巘川州巡巢工左巧巨巩巫差己已巳巴巷巽巾币市布帅帆师希帏帐帑帔帕帖帘帚帛帜帝帥带帧師席帮帳帶帷常帼帽幀幂幃幄幅幌幔幕幗幛幟幡幢幣幫干平年并幸幹幺幻幼幽幾广庄庆庇床序庐庑库应底庖店庙庚府庞废庠庥度座庫庭庵庶康庸庾廁廂廉廊廏廓廖廚廟廠廡廢廣廩廪廬廳延廷建廿开弁异弃弄弈弊弋式弑弓弔引弗弘弛弟张弥弦弧弩弭弯弱張強弹强弼彀彆彈彌彎归当录彗彘彙彝形彤彦彩彪彬彭彰影彷役彻彼彿往征徂径待徇很徉徊律後徐徑徒徕得徘徙徜從徠御徨復循徭微徵德徹徽心必忆忌忍忏忐忑忒忖志忘忙忝忠忡忤忧忪快忱念忸忻忽忾忿怀态怂怄怅怆怎怏怒怔怕怖怙怛怜思怠怡急怦性怨怩怪怫怯怵总怼怿恁恂恃恆恋恍恐恒恕恙恚恢恣恤恨恩恪恫恬恭息恰恳恶恸恹恺恻恼恽恿悄悉悌悍悒悔悖悚悟悠患悦您悬悭悯悱悲悴悵悶悸悻悼悽情惆惊惋惑惕惘惚惜惟惠惡惦惧惨惩惫惬惭惮惯惰惱惲想惴惶惹惺惻愁愆愈愉愍愎意愕愚愛愜感愠愣愤愧愫愴愷愾愿慄慈態慌慍慎慑慕慘慚慟慢慣慧慨慪慫慮慰慳慵慶慷慼慾憂憊憋憎憐憑憔憚憤憧憨憩憫憬憲憶憷憾懂懇懈應懊懋懌懍懑懒懔懟懣懦懨懲懵懶懷懸懺懼懾懿戀戈戊戋戌戍戎戏成我戒戔戕或戗战戚戛戟戡戧戩截戬戮戰戲戳戴户戾房所扁扇扈扉手才扎扑扒打扔托扛扣扦执扩扪扫扬扭扮扯扰扳扶批扼找承技抄抉把抑抒抓投抖抗折抚抛抟抠抡抢护报抨披抬抱抵抹抻押抽抿拂拄担拆拇拈拉拊拌拍拎拐拒拓拔拖拗拘拙拚招拜拟拢拣拥拦拧拨择括拭拮拯拱拳拴拷拼拽拾拿持挂指挈按挎挑挖挚挛挝挞挟挠挡挣挤挥挨挪挫振挲挹挺挽挾捂捅捆捉捋捌捍捎捏捐捕捞损捡换捣捧捨捩捫捭据捱捲捶捷捺捻掀掂掃掄掇授掉掌掏掐排掖掘掙掛掠採探掣接控推掩措掬掮掰掳掴掷掸掺掼掾揀揄揆揉揍描提插揖揚換握揣揩揪揭揮援揶揹揽揿搀搁搂搅搌損搏搐搓搔搗搛搜搞搠搡搦搪搬搭搶携搽摁摄摆摇摈摊摑摒摔摘摜摞摟摧摩摭摯摳摶摸摹摺摻撂撄撅撇撈撑撒撓撕撞撣撤撥撩撫撬播撮撰撲撳撵撷撸撺撻撼撾撿擀擁擂擄擅擇擊擋操擎擒擔擘據擞擠擡擢擤擦擬擯擰擱擲擴擷擺擻擼擾攀攆攏攒攔攖攘攙攛攜攝攢攣攤攥攪攫攬支收攸改攻放政故效敌敏救敕敖敗敘教敛敝敞敢散敦敬数敲整敵敷數斂斃文斋斌斐斑斓斕斗料斛斜斟斡斤斥斧斩斫斬断斯新斷方於施旁旃旄旅旋旌旎族旒旖旗无既旣日旦旧旨早旬旭旮旯旱时旷旺旻昀昂昆昇昊昌明昏易昔昕昙星映春昧昨昭是昱昴昵昶昼显晁時晃晉晋晌晏晒晓晔晕晖晗晚晝晟晢晤晦晨普景晰晴晶晷智晾暂暄暇暈暉暑暕暖暗暝暢暧暨暫暮暱暴暹曁曄曆曇曉曖曙曜曝曠曦曬曰曲曳更曷書曹曼曾替最會月有朋服朔朕朗望朝期朦朧木未末本札术朱朴朵朶机朽杀杂权杆杈杉杌李杏材村杓杖杜杞束杠条来杨杭杮杯杰東杳杵杷杼松板极构枇枉枋析枕林枚果枝枞枢枣枪枫枭枯枰架枷枸柁柄柏某柑柒染柔柘柚柜柝柞柠查柩柬柯柱柳柴柺柿栀栅标栈栉栊栋栎栏树栓栖栗校栢栩株样核根格栽栾桀桁桂桃桅框案桉桌桎桐桑桓桔桠桡桢档桥桦桧桨桩桫桶桿梁梅梆梏梓梔梗條梟梢梦梧梨梭梯械梳梵检棂棄棉棋棍棒棕棗棘棚棟棠棣棧森棰棱棲棵棹棺椁椅椋植椎椏椒椤椭椰椴椹椽椿楂楊楓楔楚楝楞楠楣楨楫業楮極楷楸楹楼概榄榆榈榉榔榕榛榜榨榫榭榮榴榷榻槁槊構槌槍槐槓槛槟槨槪槲槳槽槿樁樂樅樊樑樓樗標樞樟模樣樨横樯樱樵樸樹樺樽樾橄橇橈橋橐橘橙橛機橡橢橫橱橹檀檁檄檐檑檔檜檢檣檩檫檬檯檳檸檻櫂櫃櫓櫚櫛櫟櫥櫳櫸櫻欄權欏欒欖欞欠次欢欣欤欧欲欸欺欽款歃歆歇歉歌歎歐歙歟歡止正此步武歧歪歲歷歸歹死歼殁殃殄殆殇殉殊残殍殒殓殖殘殚殛殞殡殤殫殮殯殲殳殴段殷殺殼殿毁毂毅毆毋母每毒毓比毕毖毗毙毛毡毫毯毽氅氈氏氐民氓气氖氛氟氢氣氤氦氧氨氫氮氯氰氲氳水永汀汁求汇汉汊汐汕汗汛汜汝汞江池污汤汨汩汪汰汲汴汶汹決汽汾沁沂沃沅沆沈沉沌沏沐沓沔沖沙沛沟没沣沤沥沦沧沪沫沭沮沱河沸油治沼沽沾沿泄泅泉泊泌泓泔法泗泛泞泠泡波泣泥注泪泫泯泰泱泳泵泷泸泻泼泽泾洁洄洇洋洌洒洗洙洛洞津洪洮洱洲洵洶洹活洼洽派流浃浅浆浇浊测济浏浑浒浓浔浙浚浜浞浠浣浦浩浪浬浮浴海浸浹涂涅涇消涉涌涎涑涓涔涕涛涝涞涟涡涣涤润涧涨涩涪涫涮涯液涵涸涼涿淀淄淅淆淇淋淌淑淖淘淙淚淝淞淡淤淥淦淨淪淫淬淮深淳淵淶混淹淺添淼清渊渌渍渎渐渑渔渗渙渚減渝渠渡渣渤渥渦温測渭港渲渴游渺渾湃湄湊湍湎湖湘湛湟湧湫湮湯湾湿溃溅溉溏源準溘溜溝溟溢溥溪溫溯溶溺溼滁滂滄滅滇滋滌滎滑滓滔滕滚滞滟满滢滤滥滦滨滩滬滯滲滴滷滸滿漁漂漆漉漏漑漓演漕漚漠漢漣漩漪漫漬漯漱漲漳漸漾漿潁潆潇潋潍潑潔潘潛潜潞潢潤潦潭潮潯潰潸潺潼澀澄澆澇澈澌澍澎澗澜澠澡澤澧澱澳澶澹激濁濂濃濑濒濕濘濟濠濡濤濫濮濯濰濱濺濾瀅瀆瀉瀏瀑瀕瀘瀚瀛瀝瀟瀠瀣瀧瀨瀰瀲瀾灃灌灏灑灔灘灝灞灣灤火灭灯灰灵灶灸灼災灾灿炀炁炅炉炊炎炒炔炕炖炙炜炫炬炭炮炯炳炷炸点炼炽烁烂烈烊烏烘烙烛烟烤烦烧烨烩烫烬热烯烷烹烽焉焊焐焕焖焘焙焚無焦焯焰焱然煅煉煊煌煎煒煙煜煞煢煤煥煦照煨煩煬煮煲煸煽熄熊熏熒熔熙熟熠熨熬熱熵熹熾燁燃燈燉燎燒燕燙燜營燥燦燧燬燭燮燴燻燼燾爆爍爐爛爪爬爭爰爱爲爵父爷爸爹爺爻爽爾爿牀牆片版牌牍牒牖牘牙牛牝牟牠牡牢牦牧物牯牲牵特牺牽犀犁犄犊犍犒犖犛犟犢犧犬犯犰犴状犷犸犹狀狂狄狈狍狎狐狒狗狙狞狠狡狩独狭狮狯狰狱狲狳狴狷狸狹狻狼狽猁猊猎猕猖猗猙猛猜猝猞猡猢猥猩猪猫猬献猱猴猶猷猻猾猿獄獅獐獒獗獠獨獪獬獭獰獲獵獷獸獺獻獼獾玀玄玅率玉王玎玑玖玗玛玟玢玩玫玮环现玲玳玷玺玻珀珂珈珊珍珏珐珑珙珞珠珥珩班珮珲現球琅理琉琊琍琏琐琚琛琢琥琦琨琪琬琮琰琳琴琵琶琼琿瑁瑋瑕瑗瑙瑚瑛瑜瑞瑟瑣瑩瑪瑭瑰瑶瑾璀璁璃璇璉璋璎璐璜璞璣璧璨環璽瓊瓏瓒瓔瓚瓜瓠瓢瓣瓤瓦瓮瓯瓴瓶瓷甄甌甑甕甘甚甜生産甥甦用甩甫甬甭田由甲申电男甸町画畅界畏畔留畜畝畢略畦番畫異畴當畸畹畿疆疇疊疏疑疗疙疚疟疡疣疤疥疫疮疯疱疲疴疵疹疼疽疾痂病症痈痉痊痍痒痔痕痘痙痛痞痠痢痣痤痧痨痪痫痰痱痴痹痼痾痿瘀瘁瘋瘌瘍瘓瘙瘟瘠瘡瘢瘤瘦瘧瘩瘪瘫瘮瘴瘸瘾療癆癇癌癒癔癖癞癟癡癢癣癥癩癫癬癮癯癰癱癲癸登發白百皂的皆皇皈皋皎皑皓皖皙皚皮皰皱皺皿盂盅盆盈益盍盎盏盐监盒盔盖盗盘盛盜盞盟盡監盤盥盧盪目盯盱盲直相盹盼盾省眇眈眉看眙真眠眦眨眩眯眶眷眸眺眼着睁睃睇睏睐睑睚睛睜睡睢督睥睦睨睫睬睹睽睾睿瞄瞅瞌瞎瞑瞒瞞瞟瞠瞥瞧瞩瞪瞬瞭瞰瞳瞻瞼瞽瞿矇矍矗矚矛矜矢矣知矩矫矬短矮矯石矶矸矾矿砀码砂砌砍砒研砖砚砝砣砥砦砧砭砰破砵砷砸砺砾础硃硅硌硕硝硫硬确硯碇碉碌碍碎碑碓碗碘碜碟碣碧碩碭碰碱碳碴確碼碾磁磅磊磋磐磔磕磚磣磨磬磯磷磺礁礎礙礦礪礫礬礴示礼社祀祁祆祈祉祖祗祚祛祜祝神祟祠祢祥祧票祭祯祷祸祺祿禀禁禄禅禍禎福禦禧禪禮禰禱禳禹禺离禽禾秀私秃秆秉秋种科秒秘租秣秤秦秧秩秫秭积称秸移秽稀稈程稍税稔稗稚稞稟稠稣種稱稳稷稹稻稼稽稿穆穌積穎穑穗穡穢穩穫穰穴究穷穹空穿突窃窄窈窍窑窒窕窖窗窘窜窝窟窠窣窥窦窨窩窪窮窯窳窸窺窿竄竅竇竈竊立竖站竞竟章竣童竦竭端競竹竺竽竿笃笄笆笈笋笏笑笔笙笛笞笠笤符笨笫第笮笳笺笼筆筇等筋筌筍筏筐筑筒答策筛筝筠筢筮筱筵筷筹签简箇箋箍箏箐箔箕算箜管箧箩箪箫箬箭箱箴箸節篁範篆篇築篋篑篓篙篝篡篤篦篩篮篱篷篾簇簋簌簍簞簡簣簧簪簫簸簽簾簿籁籃籌籍籟籠籤籬籮籲米类籽粉粑粒粕粗粘粟粤粥粪粮粱粲粳粹粼粽精糅糊糍糕糖糗糙糜糞糟糠糧糨糯糰糸系糾紀紂約紅紆紇紈紉紊紋納紐紓純紕紗紙級紛紜素紡索紧紫紮累細紳紹紿絀終組絆結絛絝絞絡絢給絨絮統絲絳絶絹綁綃綉綏經綜綞綠綢綣綦綬維綮綰綱網綴綵綸綹綺綻綽綾綿緇緊緋緒緗緘線緝緞締緣編緩緬緯緲練緹緻縈縉縊縐縛縝縞縟縣縫縭縮縱縵縷縹縻總績繁繃繆繇繒織繕繚繞繡繩繪繫繭繮繳繹繼繽繾纂續纏纓纔纖纛纜纠纡红纣纤纥约级纨纪纫纬纭纯纰纱纲纳纵纶纷纸纹纺纽纾线练组绅细织终绉绊绌绍绎经绑绒结绔绕绘给绚绛络绝绞统绡绢绣绥绦继绩绪绫续绮绯绰绳维绵绶绷绸绺绻综绽绾绿缀缁缃缄缅缆缇缈缉缌缎缓缔缕编缗缘缙缚缛缜缝缟缠缡缢缤缥缦缨缩缪缭缮缯缰缱缴缸缺罂罄罅罈罌罐网罔罕罗罚罡罢罩罪置罰署罴罷罹羁羅羆羈羊羋羌美羔羚羞羡群羨義羯羲羶羸羹羽羿翁翅翊翌翎習翔翕翘翟翠翡翥翦翩翮翰翱翳翹翻翼耀老考耄者耆耋而耍耐耒耕耗耘耙耦耧耨耬耳耶耷耸耻耽耿聂聃聆聊聋职聒联聖聘聚聞聩聪聯聰聲聳聵聶職聽聾聿肃肄肅肆肇肉肋肌肓肖肘肚肛肜肝肠股肢肤肥肩肪肮肯肱育肴肺肾肿胀胁胃胄胆背胎胖胚胛胜胞胡胤胥胧胪胫胭胯胰胱胳胴胶胸胺能脂脅脆脉脊脍脏脐脑脓脔脖脚脛脣脩脯脱脶脸脹脾腆腊腋腌腎腐腑腓腔腕腚腥腦腩腫腭腮腰腱腳腴腸腹腺腻腼腾腿膀膂膊膏膑膘膚膛膜膝膠膨膩膳膺膻膽膾膿臀臂臃臆臉臊臌臍臏臘臚臟臠臣臥臧臨自臬臭至致臺臻臼臾舀舂舅舆與興舉舊舌舍舐舒舔舛舜舞舟舢舨航舫般舰舱舵舶舷舸船艄艇艏艘艙艟艦艨艮良艰艱色艳艶艺艾节芈芊芋芍芎芑芒芙芜芝芡芥芦芧芨芩芪芫芬芭芮芯芰花芳芷芸芹芻芽芾苇苋苌苍苎苏苑苒苓苔苕苗苛苜苞苟苡苣若苦苧苫苯英苴苹苻茁茂范茄茅茉茎茏茑茔茕茗茛茜茧茨茫茬茭茯茱茴茵茶茸茹茼荀荃荆荇草荏荐荑荒荔荚荞荟荠荡荣荤荥荧荨荪荫药荷荻荼莅莆莉莊莎莒莓莖莘莛莜莞莠莢莧莪莫莱莲莳莴获莹莺莼莽菀菁菅菇菊菌菏菖菜菟菠菡菩華菰菱菲菸菽萁萃萄萊萋萌萍萎萘萝萤营萦萧萨萬萱萵萸萼落葆葉葒著葚葛葡董葦葩葫葬葭葱葳葵葶葷葺蒂蒋蒔蒙蒜蒞蒯蒲蒸蒹蒺蒼蒿蓀蓁蓄蓉蓊蓋蓍蓑蓓蓝蓟蓠蓦蓬蓮蓴蓼蓽蓿蔌蔑蔓蔗蔚蔡蔣蔥蔦蔫蔬蔭蔷蔸蔺蔻蔼蔽蕁蕃蕉蕊蕎蕖蕙蕤蕨蕩蕪蕭蕲蕴蕾薄薅薇薈薊薏薑薔薛薜薦薨薩薪薮薯薰薹薺藉藍藏藐藓藕藜藝藤藥藩藪藹藺藻藿蘄蘅蘆蘇蘊蘋蘑蘚蘢蘭蘸蘺蘿虎虏虐虑虔處虚虜虞號虢虧虫虬虱虹虺虻虽虾蚀蚁蚂蚊蚋蚌蚓蚕蚝蚣蚤蚨蚩蚪蚯蚱蚺蛀蛆蛇蛉蛊蛋蛎蛐蛔蛙蛛蛟蛤蛭蛮蛰蛳蛹蛾蜀蜂蜃蜇蜈蜉蜊蜍蜒蜓蜕蜗蜘蜚蜜蜞蜡蜢蜥蜮蜴蜷蜻蜿蝇蝈蝉蝌蝎蝕蝗蝙蝟蝠蝦蝮蝴蝶蝸蝼螂螃螄融螞螟螢螫螭螯螳螺螻蟀蟄蟆蟈蟊蟋蟑蟒蟠蟥蟬蟮蟲蟹蟻蟾蠃蠅蠍蠔蠕蠟蠡蠢蠣蠱蠲蠶蠹蠻血衅衆行衍術衔街衙衛衝衡衢衣补表衩衫衬衮衰衲衷衽衾衿袁袂袄袅袈袋袍袒袖袜袢袤被袭袱裁裂装裆裋裏裔裕裘裙補裝裟裢裤裨裰裱裳裴裸裹製裾褂複褐褒褓褙褚褛褡褥褪褫褲褳褴褶褸褻襁襄襖襟襠襤襦襪襬襯襲西要覃覆覈見規覓視覦親覬覲覷覺覽觀见观规觅视览觉觊觎觐觑角觞解觥触觴觸言訂訃訇計訊訌討訐訓訕訖託記訛訝訟訣訥訪設許訴訶診註詁詆詈詎詐詒詔評詛詞詠詡詢詣試詩詫詬詭詮詰話該詳詹詼誄誅誆誇誉誊誌認誑誒誓誕誘誚語誠誡誣誤誥誦誨説誰課誹誼調諂諄談諉請諍諏諒論諛諜諞諢諤諦諧諫諭諮諱諳諶諷諸諺諾謀謁謂謄謅謇謊謎謐謔謖謗謙謚講謝謨謫謬謳謹謾譁證譎譏識譙譚譜警譬譯議譴護譽讀變讎讒讓讕讖讚讞计订讣认讥讦讧讨让讪讫训议讯记讲讳讴讶讷许讹论讼讽设访诀证诂诃评诅识诈诉诊诋诌词诏译诒诓诔试诗诘诙诚诛话诞诟诠诡询诣诤该详诧诨诩诫诬语诮误诰诱诲诳说诵诶请诸诹诺读诽课诿谀谁调谄谅谆谈谊谋谌谍谎谏谐谑谒谓谔谕谗谘谙谚谛谜谝谟谡谢谣谤谥谦谧谨谩谪谬谭谯谰谱谲谳谴谶谷豁豆豈豉豌豎豐豕豚象豢豪豫豬豸豹豺貂貅貉貊貌貔貘貝貞負財貢貧貨販貪貫責貯貲貳貴貶買貸費貼貽貿賀賁賂賃賄賅資賈賊賑賒賓賚賜賞賠賡賢賣賤賦質賬賭賴賺購賽贄贅贇贈贊贍贏贓贖贗贛贝贞负贡财责贤败账货质贩贪贫贬购贮贯贰贱贲贴贵贷贸费贺贻贼贽贾贿赀赁赂赃资赅赈赉赊赋赌赍赎赏赐赓赔赖赘赚赛赝赞赠赡赢赣赤赦赧赫赭走赳赴赵赶起趁趄超越趋趔趕趙趟趣趨足趴趸趺趾趿跃跄跆跋跌跎跑跖跚跛距跟跡跤跥跨跪路跳践跷跸跹跺跻踅踉踊踌踏踐踝踞踟踢踩踪踮踯踱踵踹踽蹁蹂蹄蹇蹈蹉蹊蹋蹌蹑蹒蹕蹙蹟蹠蹣蹤蹦蹩蹬蹭蹰蹲蹴蹶蹺蹼蹿躁躅躇躉躊躋躍躏躑躕躚躡躣躪身躬躯躱躲躺軀車軋軌軍軒軟軫軲軸軺軻軼軾較輅載輊輒輔輕輛輜輝輟輦輩輪輯輸輻輾輿轂轄轅轆轉轍轎轔轟轡轤车轧轨轩转轮软轰轱轲轳轴轶轸轻轼载轾轿辂较辄辅辆辇辈辉辍辎辐辑输辔辕辖辗辘辙辚辛辜辞辟辣辦辨辩辫辭辮辯辰辱農边辽达迁迂迄迅过迈迎运近返还这进远违连迟迢迤迥迦迨迩迪迫迭述迳迴迷迸迹追退送适逃逄逅逆选逊逋逍透逐逑递途逕逖逗這通逛逝逞速造逡逢連逦逮逯週進逵逶逸逻逼逾遁遂遇遊運遍過遏遐遑遒道達違遗遛遜遞遠遢遣遥遨適遭遮遲遴遵遷選遺遼遽避邀邁邂邃還邇邈邊邋邏邐邑邓邕邙邛邝邢那邦邪邬邮邯邰邱邳邴邵邶邸邹邺邻郁郅郊郎郏郑郓郗郜郝郟郡郢郦郧部郭郴郵郸都郾鄂鄆鄉鄒鄔鄖鄙鄞鄢鄧鄭鄯鄰鄱鄲鄴鄺酆酈酉酊酋酌配酒酗酝酡酢酣酥酩酪酬酮酰酱酵酶酷酸酽酿醃醇醉醋醍醐醒醜醞醣醪醫醬醮醴醺釀釁釅采釉释釋里重野量釐金釗釘釜針釣釦釧釵釺鈀鈉鈍鈐鈔鈕鈞鈣鈴鈷鈸鈺鈽鈾鈿鉀鉅鉉鉑鉗鉚鉛鉞鉢鉤鉦鉴鉸鉻銀銃銅銑銓銖銘銜銬銮銷銹銼鋁鋃鋅鋌鋏鋒鋤鋥鋪鋭鋮鋸鋼錄錐錕錘錙錚錛錠錢錦錨錫錮錯錳錶錾鍁鍇鍊鍋鍍鍔鍘鍛鍥鍬鍵鍾鎂鎊鎏鎖鎚鎢鎦鎧鎩鎬鎮鎳鏃鏈鏊鏍鏑鏖鏗鏘鏜鏞鏟鏡鏢鏤鏨鏵鏽鐃鐐鐘鐙鐧鐫鐮鐲鐳鐵鐸鐺鑄鑌鑑鑠鑣鑫鑰鑲鑷鑼鑽鑾鑿钁针钉钊钎钏钓钗钙钚钛钜钝钞钟钠钡钢钤钥钦钧钨钩钮钯钰钱钲钳钴钵钹钺钻钾钿铀铁铂铃铄铅铆铉铎铐铖铗铙铛铜铝铠铡铢铣铤铧铨铩铬铭铮铰铱铲铳银铸铺链铿销锁锃锄锅锆锈锉锋锌锏锐锒错锚锛锟锡锢锣锤锥锦锨锭键锯锰锱锲锴锵锷锹锺锻镀镁镂镇镊镌镍镏镐镑镔镖镗镛镜镝镞镢镣镫镭镯镰镱镳镶長长門閂閃閉開閎閏閒間閔閘閡閣閥閨閩閬閭閲閹閻閼閽闃闆闈闊闋闌闐闔闕闖關闞闡闢闥门闩闪闫闭问闯闰闱闲闳间闵闷闸闹闺闻闼闽闾阀阁阂阄阅阆阉阋阍阎阏阐阑阒阔阕阖阗阙阚阜队阡阪阮阱防阳阴阵阶阻阿陀陂附际陆陇陈陉陋陌降限陕陘陛陝陟陡院陣除陨险陪陰陲陳陵陶陷陸陽隅隆隊隋隍階随隐隔隕隗隘隙際障隧隨險隱隴隶隸隻隼隽难雀雁雄雅集雇雉雋雌雍雎雏雒雕雖雙雛雜雞雠離難雨雪雯雲雳零雷雹電雾需霁霄霆震霈霉霍霎霏霓霖霜霞霧霪霭霰露霸霹霽霾靂靄靈青靓靖静靚靛靜非靠靡面靥靦靨革靳靴靶靼鞅鞋鞍鞏鞑鞘鞠鞣鞫鞭韃韋韌韓韙韜韞韦韧韩韪韫韬韭音韵韶韻響頁頂頃項順須頊頌頎預頑頒頓頗領頜頡頤頦頭頰頷頸頻頽顆題額顎顓顔願顛類顥顧顫顯顰顱顴页顶顷项顺须顼顽顾顿颀颁颂预颅领颇颈颉颊颌颍颏颐频颓颔颖颗题颚颛颜额颠颢颤颦颧風颯颶颼飄飆风飒飓飕飘飙飚飛飞食飢飧飨飩飪飭飯飲飴飼飽飾餃餅餈餉養餌餍餐餑餒餓餘餛餞餡館餮餵餾餿饃饅饈饉饋饌饑饒饔饕饗饜饞饢饥饨饪饬饭饮饯饰饱饲饴饵饶饷饺饼饽饿馀馁馄馅馆馈馊馋馍馏馐馑馒馔馕首馗香馥馨馬馭馮馱馳馴駁駐駑駒駕駙駛駝駟駡駢駭駱駿騁騅騎騏騖騙騫騭騮騰騷騸騾驀驁驃驄驅驊驍驕驗驚驛驟驢驤驥驪马驭驮驯驰驱驳驴驶驷驸驹驻驼驽驾驿骁骂骄骅骆骇骈骊骋验骏骐骑骓骗骘骚骛骜骝骞骟骠骡骢骤骥骧骨骯骰骷骸骼髅髋髏髒髓體髖高髦髭髮髯髻鬃鬆鬈鬍鬓鬚鬟鬢鬣鬥鬧鬨鬩鬮鬱鬲鬻鬼魁魂魃魄魅魇魈魉魍魎魏魑魔魘魚魯魷鮁鮎鮑鮪鮫鮭鮮鯀鯁鯉鯊鯢鯤鯨鯪鯰鯽鰈鰍鰓鰥鰭鰲鰻鱉鱒鱔鱖鱗鱷鱸鱼鱿鲁鲅鲇鲈鲍鲑鲔鲛鲜鲠鲤鲧鲨鲫鲮鲲鲵鲶鲸鲽鳃鳄鳅鳌鳍鳏鳕鳖鳗鳜鳝鳞鳟鳥鳧鳩鳳鳴鳶鴆鴇鴉鴕鴛鴟鴣鴦鴨鴰鴻鴿鵑鵜鵝鵠鵡鵪鵬鵲鶉鶚鶩鶯鶴鷂鷓鷗鷙鷥鷲鷸鷹鷺鸚鸛鸝鸞鸟鸠鸡鸢鸣鸥鸦鸨鸩鸪鸭鸯鸱鸳鸵鸶鸷鸹鸽鸾鸿鹂鹃鹄鹅鹈鹉鹊鹌鹏鹑鹗鹘鹜鹞鹤鹦鹧鹫鹬鹭鹰鹳鹹鹼鹽鹿麂麋麒麓麗麝麟麥麦麩麪麸麻麽麾黃黄黍黎黏黑黔默黛黜黝點黟黠黢黥黧黨黩黯黴黷黻黼黿鼋鼎鼐鼓鼠鼬鼴鼹鼻鼾齊齋齎齏齐齑齒齙齜齟齡齣齦齧齪齬齲齶齷齿龃龄龅龇龈龉龊龋龌龍龐龔龕龙龚龛龜龟亍倖奬嬖嬛廄彖彧彫彳攷曈殭為皁穀絃綫緑缶翫謡録鍼鞦韆颳鵰卩𰆊厶氺凵丱丩屮䶹糹廴⺄㇍𠃍亅⼅𠃎㇇𠄎乁⺂㇕㇈乛㔾彐⺕㇅⺋𠃌⼹阝巛纟㇉乚𠃑𠃊𠃋㇜𠄌㇂㇞Γ巜𡭔龴マ癶コス𠃜𫝀⼫髟镸丂龶⺩𤣩覀匚匸⺬𠥓キ𰀁㐄ヰ扌丆㇀兀丌𠂇龷卝卌艹⼶廾卄朩耂丅⻗⼁丨刂虍鹵攴龰〣〢⺊冂⼌𠕁冊罒⾻𣥂冎咼⺌㗊㇣黽丄𧾷⻊钅牜攵⼃丿㇒⺧𠂒𠂉⺮𥫗饣𠘨𠘧⺈冖𠂊戶𡈼龵⺁𧰨𠂆𧘇彡勹⼓⺆⺼⺝乂㐅亻隹𠂤⾅𠆢𦥑忄𠤎犭𩙿飠⻟⻞夂夊爫⼢⺥釒疒衤礻乀㇏㇝丶⼂宀灬冫䒑ソ丬丷⺶亠訁⻍⻎辶⺀⺍氵讠𠁼ㄅㄆㄇㄈㄉㄊㄋㄌㄍㄎㄏㄐㄑㄒㄓㄔㄕㄖㄗㄘㄙㄚㄛㄜㄝㄞㄟㄠㄡㄢㄣㄤㄥㄦㄧㄨㄩㄪㄫㄬㄭ぀ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゗゘゙゚゛゜ゝゞゟ゠ァアィイゥウェエォオカガギクグケゲゴサザシジズセゼゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポミムメモャヤュユョヨラリルレロヮワヱヲンヴヵヶヷヸヹヺ・ーヽヾヿABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789　‐‑‒–—―‖‗‘’‚‛“”„‟†‡•‣․‥…‧ ‰‱′″‴‵‶‷‸‹›※‼‽‾‿⁀⁁⁂⁃⁄⁅⁆⁇⁈⁉⁊⁋⁌⁍⁎⁏⁐⁑⁒⁓⁔⁕⁖⁗⁘⁙⁚⁛⁜⁝⁞、。〃〄々〆〈〉《》「」『』【】〒〓〔〕〖〗〘〙〚〛〜〝〞〟〠〡〤〥〦〧〨〩〪〭〮〯〫〬〰〱〲〳〴〵〶〷〸〹〺〻〼□！？：；，§×· ,.?!:;'[]{}<>/()@#$%^&*-_+=€"

local t1 = {}
for p, c in utf8.codes(str) do
    table.insert(t1, utf8.char(c))
end

local function size_inter(table1, table2)
    local inter = {}
    for key, value1 in pairs(table1) do
        local same = false
        for key, value2 in pairs(table2) do
            if value1 == value2 then
                same = true
                break
            end
        end
        if same then
            table.insert(inter, value1)
        end
    end
    return #inter
end

local function forfudan_tc_first(input, env)
    local b = env.engine.context:get_option("forfudan_tc_first")
    local l = {}
    for cand in input:iter() do
        local t2 = {}
        for p, c in utf8.codes(cand.text) do
            table.insert(t2, utf8.char(c))
        end

        local hash = {}
        local dedup = {}
        for p, c in ipairs(t2) do
            if (not hash[c]) then
                dedup[#dedup + 1] = c
                hash[c] = true
            end
        end
        t2 = dedup

        local size_inter = size_inter(t1, t2)
        if (not b or size_inter == #t2) then
            yield(cand)
        else
            table.insert(l, cand)
        end
    end
    -- 非常用字词后置
    for i, cand in ipairs(l) do
        yield(cand)
    end
end

local function forfudan_tc_only(input, env)
    local b = env.engine.context:get_option("forfudan_tc_only")
    for cand in input:iter() do
        local t2 = {}
        for p, c in utf8.codes(cand.text) do
            table.insert(t2, utf8.char(c))
        end

        local hash = {}
        local dedup = {}
        for p, c in ipairs(t2) do
            if (not hash[c]) then
                dedup[#dedup + 1] = c
                hash[c] = true
            end
        end
        t2 = dedup

        local size_inter = size_inter(t1, t2)
        if (not b or size_inter == #t2) then
            yield(cand)
        end
    end
end

return { forfudan_tc_first = forfudan_tc_first, forfudan_tc_only = forfudan_tc_only }
